In [4]:
import pandas as pd

In [5]:
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG.csv", encoding="latin-1")
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [9]:
df[['Y2017','Area']].groupby('Area').sum().sort_values(by='Y2017',ascending=True).head(7)

                          Y2017
Area
Sudan (former)             0.00
Ethiopia PDR               0.00
Comoros                   59.84
Seychelles               442.34
Sao Tome and Principe  12662.63
Cabo Verde             14650.74
Guinea-Bissau          19102.77

In [35]:
# Missing count
missing_count = df['Y2014'].isnull().sum()
print(missing_count)
# Total record
total_count = df['Y2014'].size
print(total_count)
percentage = missing_count / total_count * 100
percentage

1589
60943

2.6073544131401474

In [36]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [46]:
df[['Element','Y2014','Y2015','Y2016','Y2017']].groupby('Element').sum()

,Y2014,Y2015,Y2016,Y2017
Element,,,,
Domestic supply quantity,1996716.35,2021493.55,2044842.70,2088198.10
Export Quantity,150020.64,157614.47,151920.46,182338.80
Fat supply quantity (g/capita/day),10225.56,10235.74,10102.77,10253.84
Feed,216927.89,225050.22,228958.65,223705.68
Food,1212332.49,1232361.10,1247022.17,1258888.28
Food supply (kcal/capita/day),454257.00,453383.00,451810.00,454681.00
Food supply quantity (kg/capita/yr),49650.63,49345.13,48985.28,48690.04
Import Quantity,274144.48,267018.46,286582.78,294559.09
Losses,153223.00,155439.00,157787.00,160614.00
Other uses (non-food),78718.13,66254.41,69563.68,91645.97
Processing,282923.00,287929.00,280631.00,292836.00
Production,1931287.75,1947019.39,1943537.15,2030056.89
Protein supply quantity (g/capita/day),11836.46,11833.95,11779.69,11842.45
Residuals,30149.00,30045.00,37224.00,35500.00
Seed,21922.92,23976.82,23389.20,24870.14
Stock Variation,58749.83,34910.99,33140.12,54316.91
Total Population - Both sexes,1031585.00,1058081.00,1085107.00,1112641.00
Tourist consumption,416.00,349.00,89.00,91.00

In [58]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
col = ['Age','Nationality','Overall']

dfx = pd.DataFrame(lst, columns=col, index=[i for i in range(1,4)])
dfx

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [62]:
df[['Y2017','Area']].groupby('Area').sum().sort_values(by='Y2017',ascending=False).head(1)

              Y2017
Area
Nigeria  1483268.23

In [69]:
df[(df['Area'] == 'Madagascar') & (df['Element'] == 'Protein supply quantity (g/capita/day)')][['Area', 'Y2015', 'Element']].groupby(['Area','Element']).sum()

                                                    Y2015
Area       Element
Madagascar Protein supply quantity (g/capita/day)  173.05

In [6]:
df.shape

(60943, 12)

In [1]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

ValueError: could not convert string to float: 'Algeria'

In [17]:
df[df['Element'] == 'Processing'][['Y2017', 'Element']].groupby('Element').sum()

               Y2017
Element
Processing  292836.0

In [30]:
df_mean = round(df[['Y2017']].describe().loc['mean'],2)
print(df_mean)
df_std = round(df[['Y2017']].describe().loc['std'],2)
print(df_std)

Mean  Y2017    140.92
Name: mean, dtype: float64

Y2017    1671.86
Name: std, dtype: float64

In [35]:
df['Area'].nunique()

49

In [39]:
df[df['Item'] == 'Wine'][['Item','Y2015','Y2018']].groupby('Item').sum()

        Y2015    Y2018
Item
Wine  4251.81  4039.32